app/Controllers/Home.php

SELECT *
FROM `user`
WHERE `username` = 'Rico'
 LIMIT 1
---
    public function ceklogin()
    {
        //tangkap varabel yang dikirim dari form login username dan password
        $session = session();
        $username = $this->request->getVar('username'); // ambil data username di database
        $password = $this->request->getVar('password'); // Get password from input

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();