app/Controllers/PengaturanUjian.php

    public function ujian()
    {
        if (!($this->isSiswa() && $this->bolehUjian()) && !$this->isAdmin()) {
            // Tampilkan view 403 tanpa redirect
            return view('errors/403');
        }

        $pengaturanModel = new PengaturanModel();
        $data['pengaturan'] = $pengaturanModel->findAll();
---
SELECT *
FROM `pengaturan`

    public function mulai($id_pengaturan)
    {
        if (!($this->isSiswa() && $this->bolehUjian()) && !$this->isAdmin()) {
            // Tampilkan view 403 tanpa redirect
            return view('errors/403');
        }


        $pengaturanModel = new PengaturanModel();
        $pengaturanSoalModel = new PengaturanSoalModel();
        $soalModel = new SoalModel();

        $pengaturan = $pengaturanModel->find($id_pengaturan);
        if (!$pengaturan) {
            return redirect()->to(site_url('pengaturanujian/ujian'))->with('error', 'Ujian tidak ditemukan.');
        }

        // Ambil soal berdasarkan relasi
        $relasiSoal = $pengaturanSoalModel->where('id_pengaturan', $id_pengaturan)->findAll();
        $idSoal = array_column($relasiSoal, 'id_soal');
        $soalList = $soalModel->whereIn('soal_id', $idSoal)->findAll();
---
SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`id_pengaturan` = '1'
SELECT *
FROM `pengaturan_soal`
WHERE `id_pengaturan` = '1'
SELECT *
FROM `soal`
WHERE `soal_id` IN ('2','5')